# Search for more apps here:
# https://caskroom.github.io/search

# Taps
tap 'caskroom/cask'
#tap 'caskroom/fonts'
#tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
#tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
#brew 'bash'

# Install more recent versions of some macOS tools
brew 'vim', args: ['override-system-vi']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'

# Install Binaries
#brew 'awscli'
brew 'ant'
brew 'ansible'
brew 'docker'
brew 'docker-compose'
brew 'git'
brew 'git-standup'
#brew 'graphviz'
#brew 'go'
#brew 'hub'
brew 'heroku'
#brew 'jq'
#brew 'tree'
#brew 'mackup'
#brew 'mas'
#brew 'node'
#brew 'openshift-cli'
brew 'openssl'
brew 'python'
brew 'pipenv'
#brew 'tmux'
#brew 'trash'
brew 'wget'

# Development
#brew 'php70', args: ['with-debug', 'without-apache']
#brew 'mariadb'

# Apps
#cask 'aerial'
#cask 'alfred'
cask 'atom'
#cask 'bbedit'
#cask 'beyond-compare'
#cask 'caffeine'
#cask 'cheatsheet'
#cask 'dash'
#cask 'dropbox'
#cask 'firefox'
#cask 'fluid'
#cask 'flux'
#cask 'gitify'
#cask 'google-chrome'
#cask 'google-chrome-canary'
#cask 'google-drive'
cask 'iterm2'
#cask 'kaleidoscope'
#cask 'keystore-explorer'
#cask 'mysqlworkbench'
#cask 'phpstorm'
#cask 'rescuetime'
#cask 'sequel-pro'
#cask 'skype'
#cask 'slack'
#cask 'spectacle'
#cask 'sublime-text'
#cask 'suspicious-package'
#cask 'textual'
#cask 'tower'
#cask 'transmit'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
#cask 'vlc'

# Quicklook
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'

# Fonts
#cask 'font-sauce-code-powerline'
#cask 'font-source-code-pro'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'
